#include <iostream>
using namespace std;

int main() {
    int b[2][3][4] = {
        {
            {1, 2, 3, 4},
            {5, 6, 7, 8},
            {9, 10, 11, 12}
        },
        {
            {13, 14, 15, 16},
            {17, 18, 19, 20},
            {21, 22, 23, 24}
        }
    };

    for (int i = 0; i < 2; i++) {          // 遍历表
        cout << "第 " << i + 1 << " 张表：\n";

        for (int j = 0; j < 3; j++) {      // 遍历当前表的行
            for (int k = 0; k < 4; k++) {  // 遍历当前行的列
                cout << b[i][j][k] << " ";
            }
            cout << "\n";  // 一行结束，换行
        }

        cout << "\n";      // 一张表结束，空一行
    }
}